In [64]:
#Python Pandas Tutorial (Part 5): Updating Rows and Columns - Modifying Data Within DataFrames

In [65]:
people = {
    "first":["Corey",'Jane','John'],
    "last":["Schafer",'Doe','Doe'],
    "email":["CoreyMSchafer@gmail.com",'JaneDoe@email.com','JohnDoe@email.com'],
}

In [66]:
import pandas as pd

In [67]:
df = pd.DataFrame(people)

In [89]:
df

   first     last                    email
0  Chris  Schafer  coreymschafer@gmail.com
1   Mary      Doe        janedoe@email.com
2   John      Doe      johnsmith@gmail.com

In [90]:
df.columns = ['first_name','last_name','email'] #cập nhập tên các cột

In [91]:
df

  first_name last_name                    email
0      Chris   Schafer  coreymschafer@gmail.com
1       Mary       Doe        janedoe@email.com
2       John       Doe      johnsmith@gmail.com

In [71]:
#df.columns = [x.upper() for x in df.columns] # viết hoa tất các tên các cột
df.columns = [x.lower() for x in df.columns] # viết thường tất các tên các cột
df

  first_name last_name                    email
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [72]:
df.rename(columns ={'first_name':'first','last_name':'last'},inplace = True)#cập nhập tên các cột bằng cách ánh xạ
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [73]:
df.loc[2] = ['John','Smith','JohnSmith@gmail.com'] #cập nhập nội dung trong data frame theo vị trí
#df.at[2,'last'] = 'Doe' tương tự trên
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith      JohnSmith@gmail.com

In [74]:
filt = (df['email']=='JohnSmith@gmail.com') #dùng bộ lọc để tìm kiếm
df.loc[filt ,'last'] = 'Doe'
df['email'] = df['email'].str.lower() #chuyển nội dung trong cột email thành chữ thường
df

   first     last                    email
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2   John      Doe      johnsmith@gmail.com

In [75]:
#apply được sử dụng để gọi một hàm trên các giá trị, ví dụ : xem độ dài của các giá trị của series ở cột nào đó
df['email'].apply(len)

0    23
1    17
2    19
Name: email, dtype: int64

In [76]:
#ví dụ , gọi một hàm cập nhật email thành chữ viết hoa
def update_email(email):
    return email.upper()
df['email'].apply(update_email)

0    COREYMSCHAFER@GMAIL.COM
1          JANEDOE@EMAIL.COM
2        JOHNSMITH@GMAIL.COM
Name: email, dtype: object

In [77]:
#dùng lambda trong apply
df['email'].apply(lambda x: x.lower())

0    coreymschafer@gmail.com
1          janedoe@email.com
2        johnsmith@gmail.com
Name: email, dtype: object

In [78]:
# lấy ra series nhỏ nhất
df.apply(pd.Series.min)

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [79]:
#sử dụng lambda lấy ra series nhỏ nhất , kết quả tương tự cách trên
df.apply(lambda x: x.min())

first                      Corey
last                         Doe
email    coreymschafer@gmail.com
dtype: object

In [81]:
#applyMap()
df.applymap(len)

C:\Users\Quang Huy\AppData\Local\Temp\ipykernel_14200\650211332.py:2: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(len)

   first  last  email
0      5     7     23
1      4     3     17
2      4     3     19

In [84]:
df.applymap(str.lower) #str.lower trong applymap() để viết thường toàn bộ dữ liệu

C:\Users\Quang Huy\AppData\Local\Temp\ipykernel_14200\2805864328.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df.applymap(str.lower) #str.lower trong applymap() để viết thường toàn bộ dữ liệu

   first     last                    email
0  corey  schafer  coreymschafer@gmail.com
1   jane      doe        janedoe@email.com
2   john      doe      johnsmith@gmail.com

In [85]:
#map dùng để thay thế từng giá trị trong một chuỗi bằng một giá trị khác
df['first'].map({'Corey':'Chris','Jane':'Mary'})

0    Chris
1     Mary
2      NaN
Name: first, dtype: object

In [88]:
#replace()
df['first'] = df['first'].replace({'Corey':'Chris','Jane':'Mary'})
df

   first     last                    email
0  Chris  Schafer  coreymschafer@gmail.com
1   Mary      Doe        janedoe@email.com
2   John      Doe      johnsmith@gmail.com